In [1]:
import pandas as pd
import numpy as np

In [2]:
mydata = { "Mon":[1, 1, 1, 2, 2, 2],
           "Tue":[3, 6, 9, 12, 10, 10],
           "Wed":[3, 5, 7, 10, 9, 12],
           "Thu":[3, 6, 5, 12, 8, 12],
           "Fri":[4, 2, 7, 10, 11, np.NaN]}

In [3]:
df = pd.DataFrame(mydata)

In [4]:
df

   Mon  Tue  Wed  Thu   Fri
0    1    3    3    3   4.0
1    1    6    5    6   2.0
2    1    9    7    5   7.0
3    2   12   10   12  10.0
4    2   10    9    8  11.0
5    2   10   12   12   NaN

In [5]:
df.columns[0]

'Mon'

In [6]:
for item in df.columns:
    print(item)

Mon
Tue
Wed
Thu
Fri

In [7]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
df.head(2)

   Mon  Tue  Wed  Thu  Fri
0    1    3    3    3  4.0
1    1    6    5    6  2.0

In [9]:
df.tail(2)

   Mon  Tue  Wed  Thu   Fri
4    2   10    9    8  11.0
5    2   10   12   12   NaN

In [10]:
df.columns.values

array(['Mon', 'Tue', 'Wed', 'Thu', 'Fri'], dtype=object)

In [11]:
df.Mon.count()

6

In [12]:
df['Mon']

0    1
1    1
2    1
3    2
4    2
5    2
Name: Mon, dtype: int64

In [13]:
df.Mon.min()

1

In [14]:
df.Mon.max()

2

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Mon     6 non-null      int64
 1   Tue     6 non-null      int64
 2   Wed     6 non-null      int64
 3   Thu     6 non-null      int64
 4   Fri     5 non-null      float64
dtypes: float64(1), int64(4)
memory usage: 368.0 bytes

In [16]:
len(pd.unique(df['Mon']))

2

In [17]:
df.notna().sum().sum()

29

In [18]:
df.isna().sum().sum()

1

In [19]:
df.shape

(6, 5)

In [20]:
df.dtypes

Mon      int64
Tue      int64
Wed      int64
Thu      int64
Fri    float64
dtype: object

In [21]:
df.describe()

            Mon        Tue        Wed        Thu        Fri
count  6.000000   6.000000   6.000000   6.000000   5.000000
mean   1.500000   8.333333   7.666667   7.666667   6.800000
std    0.547723   3.265986   3.326660   3.723797   3.834058
min    1.000000   3.000000   3.000000   3.000000   2.000000
25%    1.000000   6.750000   5.500000   5.250000   4.000000
50%    1.500000   9.500000   8.000000   7.000000   7.000000
75%    2.000000  10.000000   9.750000  11.000000  10.000000
max    2.000000  12.000000  12.000000  12.000000  11.000000

In [22]:
df

   Mon  Tue  Wed  Thu   Fri
0    1    3    3    3   4.0
1    1    6    5    6   2.0
2    1    9    7    5   7.0
3    2   12   10   12  10.0
4    2   10    9    8  11.0
5    2   10   12   12   NaN

In [23]:
import string

In [24]:
df['newcol'] = [i for i in string.ascii_lowercase[0:6]]

In [25]:
df

   Mon  Tue  Wed  Thu   Fri newcol
0    1    3    3    3   4.0      a
1    1    6    5    6   2.0      b
2    1    9    7    5   7.0      c
3    2   12   10   12  10.0      d
4    2   10    9    8  11.0      e
5    2   10   12   12   NaN      f

In [26]:
df.rename(columns = {'newcol':'Sat'}, inplace = True)

In [27]:
df

   Mon  Tue  Wed  Thu   Fri Sat
0    1    3    3    3   4.0   a
1    1    6    5    6   2.0   b
2    1    9    7    5   7.0   c
3    2   12   10   12  10.0   d
4    2   10    9    8  11.0   e
5    2   10   12   12   NaN   f

In [28]:
df['Sun'] = [i**2 for i in range(6)]

In [29]:
df

   Mon  Tue  Wed  Thu   Fri Sat  Sun
0    1    3    3    3   4.0   a    0
1    1    6    5    6   2.0   b    1
2    1    9    7    5   7.0   c    4
3    2   12   10   12  10.0   d    9
4    2   10    9    8  11.0   e   16
5    2   10   12   12   NaN   f   25

In [30]:
df1 = df.copy()

In [31]:
df1

   Mon  Tue  Wed  Thu   Fri Sat  Sun
0    1    3    3    3   4.0   a    0
1    1    6    5    6   2.0   b    1
2    1    9    7    5   7.0   c    4
3    2   12   10   12  10.0   d    9
4    2   10    9    8  11.0   e   16
5    2   10   12   12   NaN   f   25

In [32]:
del df['Sun']

In [33]:
df

   Mon  Tue  Wed  Thu   Fri Sat
0    1    3    3    3   4.0   a
1    1    6    5    6   2.0   b
2    1    9    7    5   7.0   c
3    2   12   10   12  10.0   d
4    2   10    9    8  11.0   e
5    2   10   12   12   NaN   f

In [34]:
df.drop(['Sat'], axis=1, inplace = True)

In [35]:
df

   Mon  Tue  Wed  Thu   Fri
0    1    3    3    3   4.0
1    1    6    5    6   2.0
2    1    9    7    5   7.0
3    2   12   10   12  10.0
4    2   10    9    8  11.0
5    2   10   12   12   NaN

In [36]:
print(df[['Mon', 'Wed', 'Fri']])

   Mon  Wed   Fri
0    1    3   4.0
1    1    5   2.0
2    1    7   7.0
3    2   10  10.0
4    2    9  11.0
5    2   12   NaN

In [37]:
df.iloc[[0,2,4],[0,1]]

   Mon  Tue
0    1    3
2    1    9
4    2   10

In [38]:
df.loc[[0,2,4],['Mon','Tue']]

   Mon  Tue
0    1    3
2    1    9
4    2   10

In [39]:
df[df.Mon != 1]

   Mon  Tue  Wed  Thu   Fri
3    2   12   10   12  10.0
4    2   10    9    8  11.0
5    2   10   12   12   NaN

In [40]:
df.Wed.value_counts(bins=4)

(2.99, 5.25]    2
(9.75, 12.0]    2
(5.25, 7.5]     1
(7.5, 9.75]     1
Name: Wed, dtype: int64

In [42]:
len(pd.unique(df['Mon']))

2

In [44]:
df.nunique(axis=1)

0    3
1    4
2    4
3    3
4    5
5    3
dtype: int64

In [45]:
df

   Mon  Tue  Wed  Thu   Fri
0    1    3    3    3   4.0
1    1    6    5    6   2.0
2    1    9    7    5   7.0
3    2   12   10   12  10.0
4    2   10    9    8  11.0
5    2   10   12   12   NaN

In [47]:
len(df.loc[df.Mon == 1 ])

3

In [48]:
df.iloc[2:, 0:1]

   Mon
2    1
3    2
4    2
5    2

In [49]:
df.loc[0:2, 'Mon']

0    1
1    1
2    1
Name: Mon, dtype: int64

In [50]:
df.groupby('Mon').agg(['mean','count','sum'])

           Tue                  Wed                  Thu                  Fri  \
          mean count sum       mean count sum       mean count sum       mean
Mon
1     6.000000     3  18   5.000000     3  15   4.666667     3  14   4.333333
2    10.666667     3  32  10.333333     3  31  10.666667     3  32  10.500000


    count   sum
Mon
1       3  13.0
2       2  21.0

In [52]:
df[['Mon', 'Tue']].groupby('Mon').agg(['mean','count','sum']).reset_index()

  Mon        Tue
            mean count sum
0   1   6.000000     3  18
1   2  10.666667     3  32

In [53]:
myresult = df.groupby('Mon', as_index = False)['Tue'].sum()

In [54]:
myresult

   Mon  Tue
0    1   18
1    2   32

In [55]:
myresult.rename(columns={'Tue':'Sum of Values for Tuesday'}, inplace = True)

In [56]:
myresult

   Mon  Sum of Values for Tuesday
0    1                         18
1    2                         32

In [59]:
x = df.groupby(['Mon','Thu']).agg({'Wed': 'sum', 'Tue':'mean', 'Fri': 'count'}).reset_index()

In [60]:
x

   Mon  Thu  Wed  Tue  Fri
0    1    3    3    3    1
1    1    5    7    9    1
2    1    6    5    6    1
3    2    8    9   10    1
4    2   12   22   11    1

In [61]:
x.rename(columns={'Wed':'Sum of Wednesday', 'Tue': 'Mean of Tuesday', 'Fri':'Count of Friday'}, inplace = True)

In [62]:
x

   Mon  Thu  Sum of Wednesday  Mean of Tuesday  Count of Friday
0    1    3                 3                3                1
1    1    5                 7                9                1
2    1    6                 5                6                1
3    2    8                 9               10                1
4    2   12                22               11                1